# Задача 9: «Очистка адресов».
# Приведение адресов объектов к стандартному формату.

import re

# 1. Исходные адреса для обработки.
addresses = [
    "  г. Москва, ул. Ленина, д. 10  ",
    "г.Казань,ул.Баумана,д.15",
    "  г. Санкт-Петербург, ул. Невский, д. 100  ",
]


def clean_address(address):
    """Приводит адрес к единому формату с корректными пробелами и запятыми."""
    # Убираем пробелы по краям строки.
    address = address.strip()

    # Добавляем пробелы после сокращений, если их нет.
    address = re.sub(r"г\.([А-Яа-я])", r"г. \1", address)
    address = re.sub(r"ул\.([А-Яа-я])", r"ул. \1", address)
    address = re.sub(r"д\.(\d+)", r"д. \1", address)

    # Унифицируем запятые: убираем лишние пробелы вокруг них.
    address = re.sub(r"\s*,\s*", ", ", address)

    return address


# 2. Обрабатываем и выводим результаты «до/после».
print("=" * 70)
print("СРАВНЕНИЕ")
print("=" * 70)

for i, addr in enumerate(addresses, 1):
    cleaned = clean_address(addr)
    print(f"#{i}")
    print(f"ДО:     '{addr}'")
    print(f"ПОСЛЕ:  '{cleaned}'")
    print("-" * 70)
